Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: ལྡོང་རོས་ཀྱི་མིག་སྨན་སྒྲུབ་པ་དང་། རལ་གྲི་སྒྲུབ་པ་དང་། རྡོ་རྗེ་སྒྲུབ་པ་དང་། རྩེ་གསུམ་སྒྲུབ་པ་དང་། འཁོར་ལོ་སྒྲུབ་པ་དང་། དུང་སྒྲུབ་པ་དང་། གཏུན་ཤིང་སྒྲུབ་པ་དང་། དགྲ་སྟ་སྒྲུབ་པ་དང་། མདའ་བོ་ཆེ་སྒྲུབ་པ་དང་། ཐོ་བ་སྒྲུབ་པ་དང་། དྲིལ་བུ་སྒྲུབ་པ་དང་། རྫས་སྒྲུབ་པ་དང་། སྨན་སྒྲུབ་པ་དང་། བཅུད་ཀྱིས་ལེན་སྒྲུབ་པ་དང་། རོ་ལངས་སློང་བར་བྱེད་པ་དང་། རང་གི་གནས་འབེབས་པ་དང་། གོས་འབེབས་པ་དང་། རིམས་འབེབས་པ་དང་། ཤི་བ་སློང་བར་བྱེད་པ་དང་། གདོན་ཐམས་ཅད་འབེབས་པ་དང་། ཐོད་པ་འབེབས་པ་དང་། བུམ་པ་འབེབས་པ་དང་། བུམ་བུ་འབེབས་པ་དང་། ལྟེང་ཀ་འབེབས་པ་དང་། དྲིལ་བུ་འབེབས་པ་དང་། ཐོ་བ་འབེབས་པ་དང་།
en: Please accept the siddhi of a realgar ointment for the eyes, the siddhi of the sword, the siddhi of the vajra scepter, the siddhi of the trident, the siddhi of the discus, the siddhi of the conch, the siddhi of the mace, the siddhi of the axe, the siddhi of the javelin, the siddhi of the hammer, and the siddhi of the bell.

source: རལ་གྲི་འབེབས་པ་དང་། མེ་ལོང་འབེབས་པ་དང་། པདྨ་འབེབས་པ་དང་། བུད་མེད་དང་། སྐྱེས་པ་དང་།
en: Please accept the ability to produce power substances, medicines, and the elixir of longevity, the ability to raise a vetāla, the ability to induce spirit possession in healthy beings, the ability to cause spirits to enter someone’s clothes, the ability to induce possession by the spirits of fever, the ability to cause a dead body to rise, the ability to induce possession by grahas, the ability to cause a spirit to enter a skull cup, jar, pitcher, pond, bell, hammer, sword, mirror, lotus, woman, man, boy, or girl, and the ability to make them beautiful and cause them to dance. “ ‘

source: བུ་མོ་འབེབས་པ་དང་།
en: Accept them, vidyā holder!

source: མཛེས་པར་བྱེད་པ་དང་། གར་བྱེད་པ་དེ་རྣམས་ཐམས་ཅད་བཀླགས་པས་གྲུབ་པ་དང་བཟླས་པས་འགྲུབ་པས་རིག་སྔགས་འཆང་རྗེས་སུ་འཛིན་ཏེ། དོན་མཐའ་ཡས་ཤིང་དོན་མཐའ་ཡས་པ་དེ་རྣམས་ཐམས་ཅད་གྲུབ་པའི་ཆེད་དུ་གྱིས་ཤིག་ཅེས་སོ། །དགོས་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དེ།
en: You will be successful in everything, obtain infinite wealth, and see all your wishes come true.

source: རིག་སྔགས་འཆང་ཁྱོད་དགེ་བ་འགྲུབ་ཅིང་རིག་པ་སྟེ།
en: You have won, vidyā holder, the auspicious accomplishment of vidyā.

source: རིག་སྔགས་འཆང་གྲུབ་པ་ཁྱོད་ཀྱིས་འཇིག་རྟེན་དང་འཇིག་རྟེན་ལས་འདས་པའི་བྱ་བ་བྱེད་པར་འགྱུར་རོ།
en: You can successfully perform all tasks, both mundane and supramundane.

source: །རིག་སྔགས་འཆང་ཁྱོད་ཤི་འཕོས་ནས་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་འགྲོའོ། །དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཁྱོད་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་ནོ།
en: When you die, vidyā holder, you will proceed to the realm of Sukhāvatī, attain the level of not turning back, and receive a prophecy from the tathāgatas of the three times regarding your future awakening.

source: །འདི་ནི་སྐྱེ་བ་ཐ་མ་སྟེ།
en: Your present birth is your last impure birth from a womb.

source: མངལ་གྱི་དྲི་མས་མ་གོས་པར་པདྨ་ལས་བརྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ། །སྐྱེ་བའི་སྐྱེ་བ་དྲན་པར་ཡང་འགྱུར་རོ།
en: You will be born spontaneously from a lotus flower with the ability to remember your successive births.

source: །ཁྱོད་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ལ་མངོན་པར་ཕྱོགས་པ་དང་།
en: You will consummate all your roots of virtue.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་དཀྱིལ་འཁོར་དང་། ཕྱག་རྒྱ་དང་། གསང་སྔགས་དང་། གཟུངས་ཀྱི་རིམ་པར་ཕྱེ་བ་དང་། ཆོ་ག་ཞིབ་མོ་ལ་ཇི་སྲིད་བྱང་ཆུབ་ལ་མཐར་ཐུག་པའི་བར་དུ་མངོན་དུ་ཕྱོགས་པར་འགྱུར་རོ།
en: All secret maṇḍalas, mudrās, mantras, dhāraṇīs, and rites of all tathāgatas will be clearly known to you, as if in front of your eyes, until the final realization of awakening.’ “

source: །དེ་བཞིན་དུ་སྒྲ་ཡིས་ལུང་སྟོན་པར་བྱེད་པ་སྨྲས་ནས་མི་སྣང་བར་འགྱུར་རོ།
en: Having spoken these words of prophecy, the king of vidyās will disappear.

source: །དེ་ནས་རིག་པའི་རྒྱལ་པོའི་རས་རིས་དེའི་སྨིན་མའི་བར་ནས་འོད་ཟེར་ཁ་དོག་སྣ་ཚོགས་པ་རྣམ་པར་བཀྲ་ཞིང་བཀྲ་བ་འབྱིན་པར་བྱེད་དེ།
en: Then, the king of vidyās in the cloth painting will emit rays of bright light of various colors from between his eyebrows and illuminate the surrounding space.

source: དེ་མ་ཐག་ཏུ་ཀུན་ནས་སྣང་བར་བྱེད་དོ། །ཀུན་ནས་སྣང་བར་བྱས་ནས་ཀྱང་། རིག་སྔགས་འཆང་གི་ལུས་ལ་བབ་སྟེ་མི་སྣང་བར་འགྱུར་རོ། །མི་སྣང་བར་གྱུར་པའི་དེ་མ་ཐག་ཏུ་རིག་སྔགས་འཆང་དེས་ཏིང་ངེ་འཛིན་སྟོང་ཕྲག་བརྒྱ་ཐོབ་པར་འགྱུར་རོ། །འདི་ལྟ་སྟེ་ཕྱིར་མི་ལྡོག་པའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་སྣང་བར་བྱེད་པའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ནས་སྒོའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ནས་འོད་ཀྱི་དཀྱིལ་འཁོར་གྱི་ཏིང་ངེ་འཛིན་དང་།
en: Shining forth, the rays will fall on the vidyā holder’s body and merge with it, instantly rendering him invisible.

source: འོད་ཡངས་པའི་དཀྱིལ་འཁོར་གྱི་ཏིང་ངེ་འཛིན་དང་། དོན་ཡོད་པ་རྣམ་པར་འཕྲུལ་པའི་ཏིང་ངེ་འཛིན་དང་། དོན་ཡོད་པ་མཆོད་པའི་ནོར་བུའི་ཏིང་ངེ་འཛིན་དང་། དོན་ཡོད་པའི་ནོར་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དངོས་གྲུབ་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ཏུ་གཟིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཕྱག་རྒྱ་རིམ་པར་ཕྱེ་བའི་ཏིང་ངེ་འཛིན་དང་། དཀྱིལ་འཁོར་གསང་བའི་ཏིང་ངེ་འཛིན་དང་། དོན་
en: He will obtain hundreds of thousands of samādhis, including the samādhi of not turning back, the luminous samādhi,the samādhi of facing all directions, the samādhi of the halo of light, the samādhi of the broad halo of light, the samādhi of amogha miracles, the samādhi of precious amogha offerings, the samādhi referred to as amogha jewel, the samādhi referred to as the splendor of accomplishment, the samādhi of the compassionate gaze, the samādhi of the set of mudrās, the samādhi of the secret maṇḍala, the samādhi of the amogha dhāraṇī, the precious sovereign samādhi of compassionate gaze, the samādhi referred to as moving on with time, the samādhi referred to as supreme lotus, the samādhi referred to as lotus gaze, the samādhi referred to as firmly established noose, the samādhi referred to as perpetually awake, the samādhi referred to as victorious light, the samādhi referred to as seeing the nakṣatras, the samādhi referred to as the accomplishment of pure light, the samādhi referred to as the brightness surrounding a jewel, the samādhi referred to as the immaculate lordly power, the samādhi referred to as illuminating rays, the samādhi referred to as correctly apprehending intellect, the samādhi referred to as being fully awake, the samādhi referred to as mudrā gaze, the samādhi referred to as lotus-like mudrā gaze, the samādhi referred to as sending continuous rain, the samādhi referred to as pure essence, the samādhi referred to as vast accomplishment, the samādhi referred to as abounding in flowers, the samādhi referred to as panoptic gaze, the samādhi referred to as universal purifier, the samādhi referred to as at the tip of the tongue, the samādhi referred to as pure syllable, the samādhi referred to as the one that purifies water, the samādhi referred to as fiery energy, the samādhi referred to as vast blessing, the samādhi referred to as attracting intelligence, the samādhi referred to as strewn with flowers, the samādhi referred to as miraculous display, the samādhi referred to as the stainlessly pure aspect of the dhāraṇī, the samādhi referred to as physical glow, and the samādhi referred to as universal purity. “

source: ཡོད་པའི་གཟུངས་ཀྱི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ཏུ་གཟིགས་པའི་ནོར་བུའི་རྒྱལ་པོའི་ཏིང་ངེ་འཛིན་དང་། དུས་ཀྱི་རྗེས་སུ་འབྲང་བའི་ཏིང་ངེ་འཛིན་དང་། པདྨ་མཆོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། པདྨ་རྣམ་པར་བལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཞགས་པ་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྟག་པར་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྒྱལ་བའི་འོད་ཟེར་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྒྱུ་སྐར་ཀུན་ཏུ་གཟིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དངོས་གྲུབ་ཀྱི་འོད་ཟེར་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ནས་ནོར་བུའི་
en: The vidyā holder will obtain this abridged list of samādhis as soon as he recites the dhāraṇī, attaining them merely through reading or recitation.

source: གཟི་བརྗིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དབང་ཕྱུག་གི་མཐུ་སྟོབས་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འོད་ཟེར་ཀུན་ནས་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བློ་ཡང་དག་པར་འཛིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གསལ་བར་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཕྱག་རྒྱ་ཀུན་ཏུ་གཟིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཕྱག་རྒྱ་ཀུན་ཏུ་གཟིགས་པའི་པདྨ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྟག་པར་ཆར་འབེབས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དྲི་མ་མེད་པའི་སྙིང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དངོས་གྲུབ་ཡངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མེ་ཏོག་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ནས་ཀུན་ཏུ་གཟིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ནས་ཀུན་ཏུ་རྣམ་པར་སྦྱོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ལྕེའི་མཆོག་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡི་གེ་རྣམ་པར་དག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆུ་ཡོངས་སུ་སྦྱོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟི་བརྗིད་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡངས་པར་བྱིན་གྱིས་བརླབས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བློ་འགུགས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མེ་ཏོག་མངོན་པར་བཀྲམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་འཕྲུལ་པ་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་རྣམ་པར་དག་ཅིང་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟི་བརྗིད་ཡན་ལག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཐམས་ཅད་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་སོ་སོར་ཐོབ་བོ། །མདོར་བསྡུ་ན་ཏིང་ངེ་འཛིན་འདི་རྣམས་བཀླགས་པ་ཙམ་དང་བཟླས་པ་ཙམ་གྱིས་འཇིག་རྟེན་པའི་སྒྲུབ་པའི་དངོས་གྲུབ་སོ་སོར་ཐོབ་བོ།
en: One who attains worldly accomplishments by his practice will obtain worldly samādhis brought on by the mantra as soon as he recites it.

source: །གང་ཞིག་བཟླས་པ་ཙམ་གྱིས་འཇིག་རྟེན་པའི་ཏིང་ངེ་འཛིན་དང་། གསང་སྔགས་དང་རྣམ་པར་འཕྲུལ་པ་རྣམས་སོ་སོར་ཐོབ་བོ།
en: He will obtain worldly samādhis and whatever siddhis they produced. “

source: །ཏིང་ངེ་འཛིན་གཞན་དེ་རྣམས་ནི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པའི་དངོས་གྲུབ་སོ་སོར་ཐོབ་བོ། །ལག་ན་རྡོ་རྗེ་འཇིག་རྟེན་ལས་འདས་པའི་ཏིང་ངེ་འཛིན་གཞན་ཡང་བཀླགས་པས་གྲུབ་པ་དང་། བཟླས་པ་ཙམ་ལས་སོ་སོར་ཐོབ་བོ།
en: The supramundane samādhis are different, Vajrapāṇi. They are obtained by those who attain the supramundane accomplishments and are obtained by merely reading or reciting the dhāraṇī.

source: །གང་གིས་འཇིག་རྟེན་ལས་འདས་པའི་དངོས་གྲུབ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བ་རིམ་པར་ཕྱེ་བ་དང་། དཀྱིལ་འཁོར་དང་། གསང་སྔགས་དང་། ཕྱག་རྒྱ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཐུན་མོང་བར་གྱུར་པ་མཐོང་བའི་དངོས་གྲུབ་སོ་སོར་ཐོབ་བོ།
en: They induce the realization of the secret sets of maṇḍalas, mantras, and mudrās of all tathāgatas and of the sameness of all tathāgata families.

source: །ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པ་གང་གིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་དུས་གསུམ་པའི་ཏིང་ངེ་འཛིན་དང་། དཀྱིལ་འཁོར་གྱི་གསང་བ་དང་། གསང་སྔགས་དང་། ཕྱག་རྒྱ་དང་། སྤྱི་གཙུག་ཀུན་ཏུ་གཟིགས་པར་འགྱུར་རོ།
en: The vidyā holder will obtain the samādhi called the perfection of seeing, the miraculous power of which will elicit the mastery of samādhis, maṇḍalas, secret mantras, and mudrās, as well as the ability to see the top of the head of all the tathāgatas of the three times.

source: །ཕྱག་རྒྱ་དང་། གསང་སྔགས་དང་། དཀྱིལ་འཁོར་དང་། ཆོ་ག་ཞིབ་མོ་གང་ཡིན་པ་དེ་རྣམས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རིགས་ཀྱི་གསང་བའི་རྒྱལ་མཚན་གྱི་མཆོག་ཏུ་ཀུན་ཏུ་གནས་སོ། །གང་གིས་སྐྱེ་བ་བརྗེས་པའི་མོད་དང་།
en: These secret mudrās, mantras, and rites will remain with the vidyā holder as a secret sigil of all the tathāgatas.

source: བསྒོམས་པའི་མོད་ལ་རྒྱལ་མཚན་གྱི་མཆོག་དང་ལྡན་པའི་སྒོ་མཆོག་ཏུ་གནས་སོ། །འདི་ལྟ་སྟེ། དོན་ཡོད་པའི་ཡེ་ཤེས་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྒྱལ་མཚན་རྩེ་མོའི་དཔུང་རྒྱན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་བདག་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དགེ་བའི་མེ་ཏོག་གཙང་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྤྱི་གཙུག་ཀུན་ཏུ་རྣམ་པར་བལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེང་གེ་རྣམ་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འོད་འབར་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟི་བརྗིད་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: They will remain in front of him like a raised banner as he experiences his death and rebirth while fully conscious. “

source: རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ནོར་བུ་རིན་པོ་ཆེ་ཆེན་པོའི་ཆར་འབེབས་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: The supramundane samādhis are the display of amogha wisdom, heroic progress, the ring at the top of a banner, the master of dhāraṇīs, the pure freshness of flowers in bloom, visible on the head,lion’s play, blazing torch, blazing with fiery energy, the mine of jewels, the dhāraṇī seal, luminous essence, pure light, the great rain of jewels, the pure amogha master, deep amogha roar, the noose of amogha accomplishment, the amogha banner, and the great light of the wish-fulfilling jewel. “

source: དོན་ཡོད་པ་དྲི་མ་མེད་པའི་བདག་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དོན་ཡོད་པ་ཟབ་མོའི་སྒྲ་སྒྲོགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དོན་ཡོད་པའི་དངོས་གྲུབ་ཀྱི་ཞགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དོན་ཡོད་པའི་རྒྱལ་མཚན་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡིད་བཞིན་གྱི་ནོར་བུའི་འོད་ཀྱི་སྣང་བ་རྒྱས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏེ།
en: These are the main supramundane samādhis that the vidyā holder will obtain.

source: འདི་རྣམས་ལ་སོགས་པའི་ཏིང་ངེ་འཛིན་མང་པོ་རྣམས་སོ་སོར་ཐོབ་ཅིང་ཏིང་ངེ་འཛིན་གཞན། འཇིག་རྟེན་ལས་འདས་པ་བརྒྱ་སྟོང་ཕྲག་བཀླགས་པ་དང་། བཟླས་པ་ཙམ་གྱིས་གྲུབ་པར་འགྱུར་རོ།
en: Additionally, as soon as he recites the dhāraṇī he will obtain hundreds of thousands of other supramundane samādhis.

source: །རིག་པའི་རྒྱལ་པོའི་གཟུངས་ཀྱི་སྙིང་པོ་འདི་ཡོན་ཏན་ཆེ་བ་དང་།
en: He will accomplish them merely by reading or reciting it.

source: ཕན་ཡོན་ཆེ་བ་དང་། རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པ་ཆེ་བ་སྟེ།
en: They will miraculously produce great qualities, great benefits, and great magical powers. “

source: དོན་ཡོད་པ་ལྕགས་ཀྱུའི་ཆོ་ག་ཞིབ་མོ་ལ། དོན་ཡོད་པ་ནོར་བུའི་མཆོད་པ་ཞེས་བྱ་བའི་གཟུངས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་དོན་ཡོད་ཞགས་པའི་སྙིང་པོའི་གཟུངས་གསུངས་པ།
en: This heart dhāraṇī, the king of vidyās taught in the section on the ritual of Amoghāṅkuśa, is called precious amogha offerings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་རྗེས་སུ་འབྲང་བ།
en: It is taught as a heart dhāraṇī of Noble Avalokiteśvara-Amoghapāśa and is certain to benefit all beings.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་སྐྱེ་བར་བྱེད་པ། སྡིག་པ་དང་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སྦྱོང་བར་བྱེད་པ།
en: It plants the roots of every virtue and purifies all wrongdoings and obscurations.

source: གཟུངས་ཀྱི་ཚིག་གི་སྙིང་པོ་གང་ཞིག་བཀླགས་པ་ཙམ་དང་བཟླས་པ་ཙམ་གྱིས་འདི་རྣམས་བྱེད་པའི་དངོས་གྲུབ་སོ་སོར་ཐོབ་པའོ། །སྒྲུབ་པ་འདི་རྣམས་ཐམས་ཅད་ནི་ལས་ཀྱི་རྣམ་པར་འཕྲུལ་དུ་འགྱུར་བ་མ་ཡིན་ནོ། །དེ་ནས་རིག་སྔགས་འཆང་དེ་སྨྱུང་བར་གནས་ཏེ།
en: By merely reading or reciting the words of this dhāraṇī, the heart essence, the vidyā holder will obtain magical powers.

source: བཟླས་པ་གཅིག་དང་བཀླགས་པའི་དངོས་གྲུབ་ཀྱིས་དེ་ལྟ་བུའི་རྒྱས་ཤིང་གསལ་བ་ཐོབ་བོ།
en: He will accomplish all the following acts without formal practice, in a single recitation or reading session while fasting. “

source: །དེ་ཁོ་ན་ཉིད་ཀྱི་དངོས་གྲུབ་ཡང་སོ་སོར་ཐོབ་སྟེ། དོན་རྒྱ་ཆེ་བ་དང་།
en: His activities will thus have a vast scope, and he will accomplish the nature of reality.

source: ལོངས་སྤྱོད་དང་ལྡན་པ་དང་། གཟུངས་ཀྱི་དངོས་གྲུབ་ཆེན་པོ་སོ་སོར་ཐོབ་བོ།
en: He will obtain mastery of the great dhāraṇī that brings vast riches and enjoyments.

source: །བཀོད་པ་ཡངས་པ་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་གསང་བ་སོ་སོར་ཐོབ་པོ།
en: He will obtain the secret samādhi and dhāraṇī that are called gazing at the vast display.

source: །དཔག་བསམ་གྱི་ཤིང་ཡང་དག་པར་གང་བའི་ཆར་འབེབས་པ་དང་།
en: He will also obtain the dhāraṇī called bounteous rain falling from the wish-fulfilling tree, and he will produce a corresponding display.

source: གཟུངས་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་བཀོད་པ་སོ་སོར་ཐོབ་བོ། །ཡིད་བཞིན་གྱི་ནོར་བུ་ཆེན་པོའི་རྒྱ་མཚོ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཆར་འབེབས་པ་དང་། ཀུན་ནས་ཀུན་ཏུ་གཟིགས་པའི་རྒྱལ་མཚན་གྱི་གཟུངས་ཀྱི་གསང་བའི་ཆར་འབེབས་པའི་དངོས་གྲུབ་སོ་སོར་ཐོབ་བོ།
en: He will obtain the banner of panoptic gaze dhāraṇī, which is like a great wish-fulfilling jewel, an ocean, and a rain of the seven precious jewels, and he will obtain the secret ability to rain down riches.

source: །ཀུན་ནས་གསེར་གྱི་རྒྱལ་མཚན་གྱི་ཆར་འབེབས་པའི་གཟུངས་ཀྱི་བཀོད་པ་རྣམ་པར་བལྟས་པ་དང་། དོན་ཡོད་པའི་བཀོད་པ་རབ་འབྱམ་གྱི་དངོས་གྲུབ་རབ་ཏུ་ཐོབ་བོ།
en: He will obtain the banner of a wide-extending golden rain dhāraṇī and the ability to produce a vast amogha panoptic display.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གཙུག་ཏོར་རྣམ་པར་ལྟ་བའི་རྒྱལ་མཚན་གྱི་གཟུངས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་སོ་སོར་ཐོབ་བོ།
en: He will obtain the banner of the uṣṇīṣa of all the tathāgatas dhāraṇī and produce the corresponding magical results. “

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསང་བའི་སྙིང་པོ་དང་། དཀྱིལ་འཁོར་རྣམ་པར་ལྟ་བའི་དངོས་གྲུབ་སོ་སོར་ཐོབ་བོ། །རྣམ་པར་ཐར་པའི་དཀྱིལ་འཁོར་ཡངས་པ་ཐམས་ཅད་སོ་སོར་ཐོབ་བོ།
en: He will likewise obtain the ability to clearly see the secret heart maṇḍalas of all the tathāgatas and will obtain all the vast maṇḍalas of liberation.

source: །ཕན་ཡོན་ཆེན་པོ་དང་། རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་བྱིན་གྱིས་བརླབས་པ་འདི་རྣམས་སོ་སོར་ཐོབ་བོ།
en: He will obtain these great, miraculous benefits and blessings and will be blessed by all the tathāgatas.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱིས་རློབ་པས་བྱིན་གྱིས་བརླབས་པས་དོན་ཡོད་པའི་ནོར་བུའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་གང་བཀླགས་པ་ཙམ་གྱིས་ཡོན་ཏན་དང་ཕན་ཡོན་རྗེས་སུ་བསྔགས་པ་དང་། རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་སོ་སོར་ཐོབ་བོ།
en: The vidyā holder who merely recites the heart dhāraṇī of precious amogha offerings will obtain many good qualities and miraculous benefits.”

source: །དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཕྱག་ན་རྡོ་རྗེ་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཤིང་མཆོག་ཏུ་སྐྱི་བུང་ཞེས་བྱེད་པ་སྐྱེས་ནས།
en: Vajrapāṇi, the great general of yakṣas, was thrilled with great joy and covered in goose bumps.

source: བཅོམ་ལྡན་འདས་ཤཱཀྱ་ཐུབ་པའི་ཞབས་ལ་བཏུད་དེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་གསུངས་པའི་དོན་ཡོད་པའི་ནོར་བུའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་གང་ཡིན་པ་འདི་མཆོག་ཏུ་རྙེད་པར་དཀའོ།
en: He prostrated at the feet of the blessed Śākyamuni and said, “This heart dhāraṇī of precious amogha offerings taught by Noble Avalokiteśvara, the great bodhisattva being, is, O Lord, extremely rare.

source: །ཡིད་བཞིན་གྱི་ནོར་བུར་གྱུར་པའི་སྙིང་པོ་གཟུངས་གང་ཡིན་པ་ནི་མཆོག་ཏུ་རྙེད་པར་དཀའོ།
en: This heart dhāraṇī, so difficult to find, is a wish-fulfilling jewel.

source: །མཐུ་ཆེན་པོ་དང་། ཕན་ཡོན་ཆེན་པོ་དང་། ཡོན་ཏན་ཆེན་པོ་སྐྱེད་པ་དང་མཐུན་པ་རྣམ་པར་འཕྲུལ་པ་དང་། ཆོ་འཕྲུལ་ཆེ་བར་བལྟ་བར་བྱའོ། །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་རིག་པའི་རྒྱལ་པོ་དེ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མའམ། དགེ་སྦྱོང་ངམ། བྲམ་ཟེའམ། རྒྱལ་རིགས་སམ།
en: It has great power, brings great benefits, produces great qualities, and creates great miraculous displays.

source: བུད་མེད་དམ། སྐྱེས་པའམ། ཁྱེའུའམ་བུ་མོ་ཡང་རུང་སྟེ། ལན་ཅིག་བཟླས་པ་དང་། དྲན་པ་ཙམ་དང་བཀླགས་པ་ཙམ་གྱིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་། དགེ་བའི་རྩ་བ་དང་ལྡན་པར་འགྱུར་རོ།
en: Tell me, O Lord, if a vidyā holder—whether the son or daughter of good family, a monk or a nun, a male or a female lay practitioner, an ascetic, a brahmin, or a kṣatriya, a woman, man, boy, or girl—would accumulate a great amount of merit and plant the roots of virtue merely by mindfully reciting or reading the dhāraṇī just once.

source: །བཅོམ་ལྡན་འདས་སྡིག་པ་ཐམས་ཅད་ཟད་པར་གྱུར་པ་དེ་ཅི་ལགས།
en: Would, O Lord, the wrongdoings of such a vidyā holder be eradicated?

source: བཅོམ་ལྡན་འདས་འཇིག་རྟེན་པ་རྣམས་གྲུབ་པར་འགྱུར་བཅི་ལགས།
en: Would they obtain worldly accomplishments?

source: འཇིག་རྟེན་ལས་འདས་པའི་ལམ་ཡོངས་སུ་དག་པར་འགྱུར་བ་ཅི་ལགས།
en: Would they clear the path to supramundane accomplishments?

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་པར་འགྱུར་བ་ཅི་ལགས།
en: Would, O Lord, the tathāgatas watch over them?

source: བཅོམ་ལྡན་འདས་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རྟག་ཏུ་མཆོག་སྩོལ་བ་དེ་ཅི་ལགས།
en: Would Noble Avalokiteśvara always grant them boons?

source: བཅོམ་ལྡན་འདས་བདག་ལ་དེའི་སྐབས་དབྱེ་བར་མཛད་དུ་གསོལ།
en: Please Lord, explain these things to me!

source: དེ་ལྟ་བུའི་ཕན་ཡོན་ཕུལ་དུ་བྱུང་བ་ནི་བཅོམ་ལྡན་འདས་མཆོག་ཏུ་ངོ་མཚར་བར་གྱུར་པའོ།
en: I am, O Lord, beset by profound uncertainty and filled with extreme curiosity.”

source: ལག་ན་རྡོ་རྗེ་ལེགས་སོ་ལེགས་སོ།
en: It is good, Vajrapāṇi!

source: །ལག་ན་རྡོ་རྗེ་མཆོག་ཏུ་རྙེད་པར་དཀའ་བའི་དྲི་བ་དྲིས་པ་དེ་ངས་ཇི་ལྟ་བ་བཞིན་དུ་ད་ལྟ་བཤད་པར་བྱ་ཡི་ཉོན་ཅིག །
en: It is very rare indeed to be asked questions like these. I will now explain how it is; please listen.

source: ལག་ན་རྡོ་རྗེ་འདི་ནི་བཀླགས་པ་ཙམ་གྱི་མོད་དང་། བརྗོད་པ་ཙམ་གྱི་མོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རྟག་ཏུ་དགའ་བ་དང་བཅས་པས་ཕྱག་གཡས་པ་སྤྱི་བོར་འཇོག་པར་བྱེད་དོ། །མངོན་སུམ་དུ་རང་གི་གཟུགས་ཀྱིས་མདུན་ན་ཉེ་བར་གནས་ཏེ་དབུགས་འབྱིན་པར་ཡང་བྱེད་དོ། །དེ་ཅི་ལྟར་ཞེ་ན།
en: As soon as this dhāraṇī becomes audible when recited or read aloud, the noble bodhisattva Avalokiteśvara will be delighted, and he will appear before the reciter in person and place his right hand on his head and give him comfort and encouragement. “

source: འདི་ནི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་རང་བཞིན་གྱིས་ལུས་ཡོངས་སུ་དག་པ་གཟུང་བའི་གཟུངས་ཀྱི་སྙིང་པོའོ།
en: To reiterate, this secret heart dhāraṇī is the natural body of Noble Avalokiteśvara in its pure aspect.

source: །འདི་ནི་དོན་ཡོད་པའི་རང་བཞིན་གྱི་སྙིང་པོའོ།
en: It is his amogha heart-essence.

source: །འདི་ནི་སྒྱུ་མ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་རྣམ་པར་འཕྲུལ་པའོ། །འདི་ནི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་རང་བཞིན་མཐོང་བའོ། །འདི་ནི་བཅུ་གཅིག་ཞལ་མཐོང་བའོ།
en: This dhāraṇī is a magical product of the illusion-like samādhi, manifesting the true nature of Noble Avalokiteśvara in his eleven-faced form.

source: །འདི་ནི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྣ་ཚོགས་པའི་གཟུགས་མཐོང་བའོ། །འདི་ནི་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གི་སྤྲུལ་པའི་སྤྲིན་མཐོང་བའོ།
en: It manifests all his forms and the multitude of his magical emanations.

source: །འདི་ནི་མགྲིན་པ་སྔོན་པོ་དང་། སྲེད་མེད་ཀྱི་བུའི་གཟུགས་མཐོང་བའོ། །འདི་ནི་འཇིག་རྟེན་གསུམ་མཐོང་བའོ། །རྟ་མགྲིན་མཐོང་བའོ། །འདི་ནི་པདྨོ་ཡངས་པའི་གསང་བའི་དཀྱིལ་འཁོར་མཐོང་བའོ།
en: It manifests the forms of Nīlakaṇṭha, Nārāyaṇa, Trailokya, and Hayagrīva, and it manifests the great secret lotus maṇḍala.

source: །འདི་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཆོད་པའི་སྤྲིན་གྱི་རྣམ་པར་འཕྲུལ་པའོ། །འདི་ནི་རྡོ་རྗེའི་སྙིང་པ་ཆེན་པོ་མཐོང་བའོ།
en: It conjures masses of offerings for all the tathāgatas and manifests the great vajra essence.

source: །འདི་ནི་མགོའི་སྙིང་པོ་ཆེན་པོའོ།
en: It is by nature a great, chief principle.

source: །འདི་ནི་སྣ་ཚོགས་པའི་གཟུགས་ཀྱི་རང་བཞིན་མཐོང་བའོ། །འདི་ནི་དོན་ཡོད་པའི་གཟུགས་དང་དོན་ཡོད་པའི་དངོས་གྲུབ་ཀྱི་རྣམ་པར་འཕྲུལ་པའོ།
en: It manifests various forms by nature, including amogha forms, and performs amogha miracles.

source: །འདི་ནི་དེས་ཐམས་ཅད་དུ་འགུགས་པས་ན་ཞགས་པར་བརྗོད་པར་བྱའོ།
en: Because it pulls everyone, it is called a “noose.”

source: །དོན་ཡོད་པ་ཡིད་བཞིན་གྱི་ནོར་བུའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་སུ་བརྗོད་པར་བྱ་སྟེ།
en: Because it is an unfailing wish-fulfilling jewel, it is called the heart dhāraṇī of offerings.

source: དོན་ཡོད་ཞགས་པའི་སྙིང་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དམ་པར་གྱུར་པའི་ངོ་བོ་ཉིད་ཀྱི་སྐུ་གཞན་དུ་གྱུར་པ་མཐོང་བ་མཚུངས་པ་སྟེ།
en: It is the heart essence of Amoghapāśa, the true nature of Noble Avalokiteśvara that is capable of manifesting other natures.

source: དོན་ཡོད་པའི་ནོར་བུའི་མཆོད་པའི་སྙིང་པོའི་གཟུངས་འདི་དག་མཐོང་བ་དང་མཚུངས་པར་འགྱུར་རོ།
en: This heart dhāraṇī of precious amogha offerings is able to manifest all of this. “

source: །བཀླགས་པ་དང་བརྗོད་པ་ཙམ་གྱི་མོད་ལ་དུས་གསུམ་དུ་གཤེགས་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཐུགས་ཀྱི་སྲས་གཅིག་པུར་འགྱུར་རོ།
en: As soon as the vidyā holder reads or pronounces this dhāraṇī, he will become the sole heart-son of all the tathāgatas of the three times.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཡོངས་སུ་དག་པའི་སྐུ་ཤིན་ཏུ་དྲི་མ་མེད་ཅིང་ཡོངས་སུ་དག་པ་དང་མཉམ་པར་འགྱུར་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྙིང་པོའི་སྐུར་ཡང་འགྱུར་རོ།
en: He will be just like the tathāgatas, with a body that is perfectly pure and shares their tathāgata nature.

source: །དུས་གསུམ་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཕྱིར་མི་ལྡོག་པར་ལུང་སྟོན་ཅིང་། བླ་ན་མེད་པའི་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པར་འགྱུར་རོ།
en: All the tathāgatas of the three times will prophesy his attainment of the level of not turning back and his subsequent supreme realization of the awakened state.

source: །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་མཐོང་བར་འགྱུར་རོ། །ལྷ་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་དབུགས་འབྱིན་པར་འགྱུར་རོ།
en: He will be able to see and meet any bodhisattva at any time and will receive comfort and encouragement from all the devas. “
